index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-06 to. 20:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Blog</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Knut Olav Bøhmer" />
</head>
<body>
<div id="content">
<h1 class="title">Blog</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline7">2016</a>
<ul>
<li><a href="#orgheadline6">2016-10 oktober</a>
<ul>
<li><a href="#orgheadline5">2016-10-06 torsdag</a>
<ul>
<li><a href="#orgheadline1">Testing org-caputre.</a></li>
<li><a href="#orgheadline2">popgetf</a></li>
<li><a href="#orgheadline4">Parsing dates in lisp</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">2016</h2>
<div class="outline-text-2" id="text-orgheadline7">
</div><div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">2016-10 oktober</h3>
<div class="outline-text-3" id="text-orgheadline6">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">2016-10-06 torsdag</h4>
<div class="outline-text-4" id="text-orgheadline5">
</div><div id="outline-container-orgheadline1" class="outline-5">
<h5 id="orgheadline1">Testing org-caputre.</h5>
<div class="outline-text-5" id="text-orgheadline1">
<p>
Wow! This is cool :)
</p>

<p>
Entered on: <span class="timestamp-wrapper"><span class="timestamp">[2016-10-06 to. 19:49]</span></span>
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-5">
<h5 id="orgheadline2">popgetf</h5>
<div class="outline-text-5" id="text-orgheadline2">
<p>
Wouldn't it be nice if remf could return the key/value it is removing?
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="orgsrcblock1">POPREMF&gt; (<span style="color: #00ffff;">let</span> ((plist (list <span style="color: #b0c4de;">:key1</span> <span style="color: #ffc1c1;">"val2"</span> <span style="color: #b0c4de;">:key2</span> <span style="color: #ffc1c1;">"val2"</span> <span style="color: #b0c4de;">:key3</span> <span style="color: #ffc1c1;">"val3"</span>)))
           (popremf <span style="color: #b0c4de;">:key2</span> plist))
(<span style="color: #b0c4de;">:KEY1</span> <span style="color: #ffc1c1;">"val2"</span> <span style="color: #b0c4de;">:KEY3</span> <span style="color: #ffc1c1;">"val3"</span>)
(<span style="color: #b0c4de;">:KEY2</span> . <span style="color: #ffc1c1;">"val2"</span>)
</pre>
</div>
</div>

<ul class="org-ul"><li><a id="orgheadline3"></a>popgetf.lisp<br  /><div class="outline-text-6" id="text-orgheadline3">
<script src="https://gist.github.com/knobo/b26fe906ef1e72a26402840ed34a6848.js"></script>
</div></li></ul>
</div>

<div id="outline-container-orgheadline4" class="outline-5">
<h5 id="orgheadline4">Parsing dates in lisp</h5>
<div class="outline-text-5" id="text-orgheadline4">
<p>
When parsing dates with Common Lisp library local-time, you need to
set :offset to nil, or else you might end up with a date in a
compleatly different timezone then you are in. Not surprisingly GMT,
though.
</p>
<div class="org-src-container">

<pre class="src src-lisp" id="orgsrcblock2">(<span style="color: #00ffff;">let</span> ((local-time:*default-timezone* (local-time:find-timezone-by-location-name <span style="color: #ffc1c1;">"Asia/Kolkata"</span>)))
  (local-time:parse-timestring <span style="color: #ffc1c1;">"2016-10-06"</span> <span style="color: #b0c4de;">:offset</span> nil))
@2016-10-05T20:30:00.000000+02:00

(<span style="color: #00ffff;">let</span> ((local-time:*default-timezone* (local-time:find-timezone-by-location-name <span style="color: #ffc1c1;">"Europe/Oslo"</span>)))
  (local-time:parse-timestring <span style="color: #ffc1c1;">"2016-10-06"</span> <span style="color: #b0c4de;">:offset</span> nil))
@2016-10-06T00:00:00.000000+02:00
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Knut Olav Bøhmer</p>
<p class="email">Email: <a href="mailto:bohmer at gmail.com">bohmer at gmail.com</a></p>
<p class="date">Created: 2016-10-06 to. 20:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
